@extends('layouts.app')

@section('content')

    <div class="layout-px-spacing">

        <div class="account-settings-container layout-top-spacing">

            <div class="account-content">
                <div class="scrollspy-example" data-spy="scroll" data-target="#account-settings-scroll"
                     data-offset="-100">
                    <div class="row">

                        <div class="col-xl-12 col-lg-12 col-md-12 col-sm-12 layout-top-spacing">

                            <div class="bio layout-spacing ">
                                <div class="widget-content widget-content-area">
                                    <h6 class="" style="text-align: center;">КОНТАКТНЫЙ ЦЕНТР SMARTER</h6>
                                    <div class="row">
                                    <div class="col-xl-12 col-lg-12 col-md-12 col-sm-12 col-12 layout-spacing" >
                                       <br>
                                        <p>  SMARTER – аутсорсинговый омниканальный
                                        контактный центр с представительствами в Санкт-Петербурге, Пскове, Пензе, Сердобске, Кузнецке,
                                        Кирове, Великом Новгороде и Шымкенте.</p>
                                        <br>
                                        <p>За 7 лет работы мы реализовали около 1
                                            500 проектов телемаркетинга и горячих линий. Мы продаем банковские продукты, привлекаем
                                            новых клиентов для юридических, консалтинговых, страховых, телеком и IT компаний,
                                            медицинских центров и многих других, принимаем обращения по всем каналам связи, включая
                                            мессенджеры и социальные сети, консультируем, работаем как техподдержка, и это далеко не
                                            полный список того, что мы умеем.</p>
                                        <br> <p>Мы работаем на собственном
                                            программно-аппаратном комплексе – Smarter-on-Demand (SoD). SoD автоматизирует телефонные
                                            звонки, позволяет обрабатывать большое количество контактов за короткое время, в режиме
                                            реального времени показывает статистику по обращениям, длительность ожидания ответа,
                                            уровень обслуживания и другие параметры.</p>
                                        <br> <p>Вам не нужно думать о качестве
                                            звонков, мы внимательно следим за ходом проекта и контролируем работу операторов на всех
                                            этапах: записываем и прослушиваем телефонные звонки, анализируем статистику, выбираем
                                            наиболее эффективные речевые модули и масштабируем их на всех операторов.</p>
                                    </div>

                                    </div>
                                </div>
                            </div>

                        </div>
                    </div>

                </div>
            </div>
        </div>
    </div>
@endsection
