<?php


namespace App\Faker;

use Faker\Provider\Person;

class AnimalNameProvider extends Person
{
    /**
     * Муж. клички
     * @var array
     */
    protected static $animalNameMale = [
        'Акеми','Аматори','Армат','Арчи','Ассоль','Аякс','Бадди','Байт','Бакс','Балу','Барни','Батлер','Беним','Бим','Блэк','Болто','Борнео','Бостон','Брабус','Бруно','Бул','Буллет','Буч','Бэк','Бэкхем','Бэн','Бэнтли','Бэтмен','Валли','Вальтер','Ватсон','Вегас','Веня','Винд','Гамбо','Гамер','Гарик','Гера','Гизмо','Гоша','Гриша','Гром','Гуч','Гуччи','Дарт-Вэйдер','Дени','Джек','Джексон','Джесси','Джефферсон','Джойстик','Джорж','Директор','Дони','Дориан','Жан','Жора','Зев','Зет','Зорик','Итан','Кайсар','Каспер','Катсу','Кейси','Кекс','Клайд','Коллин','Королек','Кот','Кузя','Линч','Локи','Люцифер','Майкрафт','Майло','Маки','Макс','Марвин','Маркес','Марс','Мартин','Месси','Мирон','Моня','Мэйджик','Мэйсон','Норд','Оливер','Оушен','Папай','Патрик','Пипито','Ра','Рева','Риддик','Ричард','Рой','Роки','Росси','Рури','Рэй','Рэкс','Рэтт-Батлер','Сева','Сеня','Сильвер','Симба','Спарки','Спот','Старк','Сэм','Сэр','Тадаши','Тайга','Тайсон','Тамерлан','Татоша','Тим','Авольт','Тишка','Тоник','Тори','Трой','Тэри','Умка','Уно','Урфин','Финчер','Фишка','Флэш','Фокс','Франт','Франц','Фред','Фрей','Хамстер','Харлей','Цезарь','Чарли','Шон','Шумахер','Эрик','Эркюль','Юкки','Хэппи'
    ];

    /**
     * Жен. клички
     * @var array
     */
    protected static $animalNameFemale = [
        'Адель','Айва','Айка','Алиса','Альба','Альма','Альта','Анги','Ассоль','Асти','Астра','Ася','Беверли','Бесси','Бина','Блэкки','Бонита','Боня','Бруна','Бэлла','Бэрри','Бэтти','Ванда','Варя','Веснушка','Вита','Вэнди','Ганя','Гекуба','Герда','Глая','Грейс','Груша','Дайнерис','Дарина','Дея','Джесси','Джиджи','Джипси','Джулия','Дина','Дуся','Дэля','Ева','Ева','Ёка','Елка','Зара','Зэт','Изольда','Ирма','Карамелька','Катсу','Кейси','Келли','Кира','Клеопатра','Кнопа','Кора','Ктулха','Лада','Лайла','Лапа','Лета','Лея','Лиса','Лолита','Лора','Люся','Люша','Марго','Маруся','Мика','Мина','Мира','Митсу','Мишель','Мия','Молли','Моника','Мышка','Мэйбел','Николь','Нойрин','Няша','Петра','Полина','Пуша','Рада','Рита','Сандра','Сильва','Сима','Скалли','Соля','Соня','Тайга','Татоша','Таффи','Тея','Тося','Тэсси','Тэя','Умка','Уна','ФАЯ','Фиби','Фишка','Фора','Челси','Шанди','Шэми','Шэридан','Эба','Элли','Эльза','Юки','Юта','Яра','Ясмина'
    ];

    public function animalNameMale()
    {
        return static::randomElement(static::$animalNameMale);
    }

    public function animalNameFemale()
    {
        return static::randomElement(static::$animalNameFemale);
    }

    /**
     * Возвращаем кличку в зависимости от пола
     * @param null $gender
     * @return mixed
     */
    public function animalName($gender = null)
    {
        if ($gender === static::GENDER_MALE) {
            return $this->animalNameMale();
        } elseif ($gender === static::GENDER_FEMALE) {
            return $this->animalNameFemale();
        }

        return $this->animalName(static::randomElement(array(
            static::GENDER_MALE,
            static::GENDER_FEMALE,
        )));
    }
}