<?php

return [
    'title' => 'Список Статей',
    'title_edit' => 'Редактирование',
    'title_added' => 'Добавление Статьи',
    'fields' => [
        'id' => 'id',
        'name' => 'Имя',
        'slug' => 'url',
        'date' => 'Дата создания',
        'rating' => 'Рейтинг',
        'sort' => 'Сортировка',
        'short_desc' => 'Анонс',
        'desc' => 'Описание',
        'meta_title' => 'Заголовок страницы',
        'meta_desc' => 'Описание страницы',
    ],
    'navbar' => [
        'home' => 'Основное',
        'seo' => 'SEO'
    ],
    'button' => [
        'edit' => 'Редактировать',
        'save' => 'Сохранить',
        'delete' => 'Удалить',
        'add' => 'Добавить',
        'view' => 'Просмотр',
        'return' => 'Вернуться'
    ],
    'event' => [
        'update' => 'Успешно обновленно статья',
        'add' => 'Добавлена новая статья',
        'delete' => 'Успешно удалена статья'
    ]
];
