<?php
return [
    "dashboard" => "главная",
    "details" => "подробности",
    "documents" => "{0} Нет документов|[1] Документ|[2,*] Документы",
    "estimated" => "Предполагаемая дата получения соответствующих документов.",
    "lorem" => "Lorem ipsum dolor sit amet",
    "messages" => "{0} Нет сообщений|[1] Сообщение|[2,*] Сообщения",
    "orders" => "{0} Нет заказов|[1] Заказ|[2,*] Заказы",
    "pending" => "В обработке",
    "quantity" => "Количество",
    "status" => "Статус",
    "users" => "{0} Нет пользователей|[1] Пользователь|[2,*] Пользователи",
];
