<?php
return [
    "already" => "Уже зарегистрированы?",
    "confirm" => "Подтвердите пароль",
    "email" => "Email",
    "enter" => "Введите имя пользователя и пароль",
    "failed" => "Эти учетные данные не соответствуют нашим записям.",
    "firstName" => "Имя",
    "lastName" => "Фамилия",
    "login" => "Вход",
    "newEnter" => "Введите имя пользователя и пароль для регистрации",
    "newUser" => "Новый пользователь? Зарегистрируйтесь <a href=\"/register\">здесь</a>",
    "password" => "Пароль",
    "register" => "Регистрация",
    "remember" => "Запомнить меня",
    "signup" => "Готово",
    "throttle" => "Слишком много попыток входа в систему. Повторите попытку через: секунды.",
    "yourEmail" => "Ваш адрес электронной почты",
    "yourName" => "Ваше имя"
];
