<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Home Language Lines
    |--------------------------------------------------------------------------
    */

    'description'                => 'удобный инструмент для исследования удовлетворенности пользователей, получения отзывов, маркетингового исследования и другие онлайн опросники и анкеты.',
    "create_polls"               => "Создавайте опросы",
    "conduct_marketing_research" => "Проводите маркетинговые исследования",
    "collect_feedback"           => "Собирайте обратную связь",
];
