<?php

return [

    //main page
    'h1_main_page' => 'Приветствуем на главной странице',
    'content_main_page' => '<p>Приветствуем на главной странице!</p>'.
    '<p>Здесь будут выводиться несколько самых актуальных объявлений сайта</p>',
    //end main page

    //news
    'h1_news' => 'Новости',
    'content_news' => '<p>Приветствуем на странице новостей!</p>'.
        '<p>Здесь будут выводиться новости сайта</p>',
    //end news

    //adv
    'h1_adv' => 'Объявления',
    'content_adv' => '<p>Приветствуем на странице объявлений!</p>'.
        '<p>Здесь будут выводиться объявления</p>',
    //end adv

    //about
    'h1_about' => 'О проекте',
    'content_about' => '<p>Приветствуем на странице о проекте!</p>'.
        '<p>Здесь будет текст о проекте</p>',
    //end about

    //login
    'h1_login' => 'Авторизация',
    'content_login' => '<p>Приветствуем на странице авторизации!</p>'.
        '<p>Здесь будет форма авторизации</p>',
    //end login

    //register
    'h1_register' => 'Регистрация',
    'content_register' => '<p>Приветствуем на странице регистрации!</p>'.
        '<p>Здесь будет форма регистрации</p>',
    //end register

    //other
    'welcome' => 'Привет',
    'copyrights' => 'Все права защищены',
    'policy' => 'Политика конфиденциальности',

];
