<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Common Language Lines
    |--------------------------------------------------------------------------
    */

    "developed_by" => "Разработано Александром Кузнецовым в :year&nbsp;г.",
    "is"           => "это",
    "contact_us"   => "Связаться с нами",
    "login"        => "Вход",
    "do_login"     => "Войти",
    "register"     => "Регистрация",
    "do_register"  => "Зарегистрироваться",
    'go_back'      => '&larr; Назад',
    'field_name'   => 'Название поля',
    'form_submit'  => 'Сохранить',
    'form_delete'  => 'Удалить',
];
