<?php

return [

    'Profile' => 'Моя страница',
    'Users' => 'Пользователи',
    'users' => 'Пользователи',
    'Sign_out' => 'Выйти',
    'Dashboard' => 'Главная',
    'Records' => 'Записи',
    'Simple' => 'Прослушка записей',
    'Advanced' => 'Прослушка записей расширенная',
    'Statistic' => 'Статистика',
    'Online' => 'Онлайн-статистика',
    'Efficiency' => 'Эффективность',
    'Reports' => 'Отчеты',
    'Stat' => 'Статистический отчет',
    'Service' => 'Сервисный отчет',
    'Processed-calls' => 'Отчет по обработанным звонкам',
    'Processed Calls' => 'Отчет по обработанным звонкам',
    'Balance' => 'Отчет по остаткам оказываемых услуг',
    'Quotas' => 'Отчет по выполнению квот',
    'Calls' => 'Отчет по вызовам',
    'About' => 'О компании',
    'About Us' => 'О компании',
    'Login' => 'Войти',
    'Edit' => 'Редактирование пользователя',
    'Create' => 'Создание пользователя',
];
